/**
	 __  _______  _    ____  _  __      __  __    ____   ___  _____ _____ 
	 \ \/ /_   _|/ \  |  _ \| |/ / 塔   \ \/ /   / ___| / _ \|  ___|_   _| 软
	  \  /  | | / _ \ | |_) | ' /  克    \  /____\___ \| | | | |_    | |   件
	  /  \  | |/ ___ \|  _ <| . \  创    /  \_____|__) | |_| |  _|   | |   生
	 /_/\_\ |_/_/   \_\_| \_\_|\_\ 新   /_/\_\   |____/ \___/|_|     |_|   态
                              
  ****************************************************************************** 
  *           
  * 版权所有： XTARK@塔克创新  版权所有，盗版必究
  * 官网网站： www.xtark.cn
  * 淘宝店铺： https://shop246676508.taobao.com  
  * 塔克媒体： www.cnblogs.com/xtark（博客）
	* 塔克微信： 微信公众号：塔克创新（获取最新资讯）
  *      
  ******************************************************************************
  * @作  者  Musk Han@XTARK
  * @版  本  V1.0
  * @日  期  2019-10-26
  * @内  容  CAN通信
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AX_CAN_H
#define __AX_CAN_H

/* Includes ------------------------------------------------------------------*/	 
#include "stm32f10x.h"

//常用波特率设置参数
#define CAN_BRP_1000K  6   //波特率为1M的时钟分频数
#define CAN_BRP_500K  12   //波特率为500K的时钟分频数
#define CAN_BRP_100K  60   //波特率为100K的时钟分频数

//X-SOFT接口函数
void AX_CAN_Init(void); //CAN 初始化
void AX_CAN_SendPacket(uint8_t *pbuf, uint8_t len, uint8_t id);  //CAN 发送数据（X-Protocol协议）
uint8_t AX_CAN_GetRxData(uint8_t *pbuf);  //CAN 获取接收的数据

#endif 

/******************* (C) 版权 2019 XTARK **************************************/
